src/cf/Catalogs/УзлыКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УзлыКОД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРежимеВосстановления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаАктуальностиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецИнтервалаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИнтервалаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПолучатьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПриложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервисов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксШтрихкода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПриложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверСервисов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаПриложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаСервисов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиТранспортаКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиТранспортаКОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКОД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньИсторииКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПотоковКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДатаВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИмяСообщенияКОД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыТранспортаКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаКОД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTPСервер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправленияПотоковКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияПотоковКОД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/УзлыКОД/Forms/ФайлыВКаталогеОбменаПоУзлам/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("Автообновление", 600, Ложь); // раз в 10 минут
КонецПроцедуры

&НаКлиенте
Процедура Автообновление()
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФайлы(ТекУзелКОД, ТаблЗнач)
	
	ЭтотУзел = Справочники.УзлыКОД.ЭтотУзел;
	
	ВидТранспорта = Перечисления.ВидыТранспортаКОД.ОбщийКаталог;
	ОбщийКаталог = "";
	
	Запись = РегистрыСведений.НастройкиТранспортаКОД.СоздатьМенеджерЗаписи();
	Запись.Узел = ТекУзелКОД;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		ВидТранспорта = Запись.ВидТранспорта;
		Настройки = Запись.Настройки.Получить();
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			Настройки.Свойство("ОбщийКаталог", ОбщийКаталог);
		КонецЕсли;
	КонецЕсли;
	
	РазмерФайлов = 0;
	КоличествоФайлов = 0;
	
	РазмерФайловПриемка = 0;
	РазмерФайловОтправка = 0;
	
	Если ЗначениеЗаполнено(ОбщийКаталог) Тогда
		
		Каталог = Новый Файл(ОбщийКаталог);
		Если Каталог.Существует() Тогда
	
			// от другого узла к нашему  - на приемку
			МаскаФайлов = СтрШаблон("%1to%2at*.json",
				ТекУзелКОД.Код,
				ЭтотУзел.Код);
			МассивФайлов = НайтиФайлы(ОбщийКаталог, МаскаФайлов, Ложь);
			Если МассивФайлов.Количество() = 0 Тогда
				ФайлыИКаталоги = НайтиФайлы(ОбщийКаталог, "*.*", Ложь);
				Для Каждого ФайлИлиКаталог Из ФайлыИКаталоги Цикл
					Если ФайлИлиКаталог.ЭтоКаталог()
						И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ФайлИлиКаталог.Имя) Тогда
						МассивФайловКаталога = НайтиФайлы(ФайлИлиКаталог.ПолноеИмя, МаскаФайлов, Ложь);
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивФайлов, МассивФайловКаталога);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			КоличествоФайлов = МассивФайлов.Количество();
			
			Для Каждого Файл Из МассивФайлов Цикл
				
				Попытка
					ФлРазмер = Файл.Размер();
					РазмерФайлов = РазмерФайлов + ФлРазмер;
					РазмерФайловПриемка = РазмерФайловПриемка + ФлРазмер;
				Исключение	 // файл могли уже переместить
				КонецПопытки;
				
			КонецЦикла;	
			
			
			// от нашего узла к другому - отправка
			МаскаФайлов = СтрШаблон("%1to%2at*.json",
				ЭтотУзел.Код,
				ТекУзелКОД.Код);
			МассивФайлов = НайтиФайлы(ОбщийКаталог, МаскаФайлов, Ложь);
			Если МассивФайлов.Количество() = 0 Тогда
				ФайлыИКаталоги = НайтиФайлы(ОбщийКаталог, "*.*", Ложь);
				Для Каждого ФайлИлиКаталог Из ФайлыИКаталоги Цикл
					Если ФайлИлиКаталог.ЭтоКаталог()
						И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ФайлИлиКаталог.Имя) Тогда
						МассивФайловКаталога = НайтиФайлы(ФайлИлиКаталог.ПолноеИмя, МаскаФайлов, Ложь);
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивФайлов, МассивФайловКаталога);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			КоличествоФайлов = КоличествоФайлов + МассивФайлов.Количество();
			
			Для Каждого Файл Из МассивФайлов Цикл
				
				Попытка
					ФлРазмер = Файл.Размер();
					РазмерФайлов = РазмерФайлов + ФлРазмер;
					РазмерФайловОтправка = РазмерФайловОтправка + ФлРазмер;
				Исключение	 // файл могли уже переместить
				КонецПопытки;
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;	
	
	НовСтр = ТаблЗнач.Добавить();
	НовСтр.Размер = РазмерФайлов;
	
	НовСтр.РазмерСтрока = ПолучитьРазмерСтрокой(РазмерФайлов);
	НовСтр.Количество = КоличествоФайлов;
	
	НовСтр.РазмерОтправка = РазмерФайловОтправка;
	НовСтр.РазмерСтрокаОтправка = ПолучитьРазмерСтрокой(РазмерФайловОтправка);
	НовСтр.РазмерПриемка = РазмерФайловПриемка;
	НовСтр.РазмерСтрокаПриемка = ПолучитьРазмерСтрокой(РазмерФайловПриемка);
	
	НовСтр.Узел = ТекУзелКОД;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерСтрокой(Размер)
	
	Если Размер = 0 Тогда
		Возврат "";
	КонецЕсли;	
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 Мб'"),
		Формат(Окр(Размер / 1024 / 1024, 1, 1), "ЧГ=0"));
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ЭтотУзел = Справочники.УзлыКОД.ЭтотУзел;
	
	ТаблЗнач = РеквизитФормыВЗначение("ТаблицаФайлы");
	ТаблЗнач.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УзлыКОД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УзлыКОД КАК УзлыКОД
		|ГДЕ
		|	УзлыКОД.ПометкаУдаления = ЛОЖЬ
		|	И УзлыКОД.НеОтправлятьДанные = ЛОЖЬ
		|	И УзлыКОД.НеПолучатьДанные = ЛОЖЬ
		|	И УзлыКОД.Ссылка <> &ТекСсылка";
	
	Запрос.УстановитьПараметр("ТекСсылка", ЭтотУзел);
	
	МассивУзловКОД = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для Каждого УзелПлана Из МассивУзловКОД Цикл
		ЗаполнитьФайлы(УзелПлана, ТаблЗнач);
	КонецЦикла;	
	
	РазмерФайлов = 0;
	ИтогКоличество = 0;
	Для Каждого Стр Из ТаблЗнач Цикл
		
		РазмерФайлов = РазмерФайлов + Стр.Размер;
		ИтогКоличество = ИтогКоличество + Стр.Количество;
		
	КонецЦикла;	
	ИтогРазмер = ПолучитьРазмерСтрокой(РазмерФайлов);
	
	ТаблЗнач.Сортировать("Узел");
	ЗначениеВРеквизитФормы(ТаблЗнач, "ТаблицаФайлы");
	
	ДатаОбновления = ТекущаяДатаСеанса();
	
	ПолученоБайт = РегистрыСведений.ИсторияКОД.РазмерСообщенийЗаСегодня(Перечисления.НаправленияПотоковКОД.Получение);
	ОтправленоБайт = РегистрыСведений.ИсторияКОД.РазмерСообщенийЗаСегодня(Перечисления.НаправленияПотоковКОД.Отправка);
	ИнфоРазмерЗаДень = СтрШаблон(НСтр("ru = 'Сегодня получено %1, отправлено %2.'"),
		РаботаСоСтроками.ПолучитьРазмерСтрокой(ПолученоБайт),
		РаботаСоСтроками.ПолучитьРазмерСтрокой(ОтправленоБайт));
	
КонецПроцедуры
